# IMPORTAR LIBRERIAS

In [69]:
import mysql.connector as con
import pandas as pd
import pymysql # Para ver la versión
import sqlalchemy # Para ver la versión
from sqlalchemy import create_engine

In [70]:
print(f"Conector: {con.__version__}")
print(f"Pandas: {pd.__version__}")
print(f"pymysql: {pymysql.__version__}")
print(f"sqlalchemy: {sqlalchemy.__version__}")

Conector: 9.1.0
Pandas: 2.2.3
pymysql: 1.4.6
sqlalchemy: 2.0.37

# PARTE 1: CREAR BASE DE DATOS Y CREAR TABLAS

Código SQL para la creacion de base de datos y tablas

In [71]:
sql_creacion = """ 
DROP DATABASE IF EXISTS supermercado;

CREATE DATABASE IF NOT EXISTS supermercado;

USE supermercado;

CREATE TABLE IF NOT EXISTS tiendas (
    id_tienda INT AUTO_INCREMENT PRIMARY KEY,
    nombre_tienda VARCHAR(100),
    direccion VARCHAR(255),
    ciudad VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS empleados (
    id_empleado INT AUTO_INCREMENT PRIMARY KEY,
    nombre_empleado VARCHAR(100),
    puesto VARCHAR(50),
    id_tienda INT NOT NULL,
    FOREIGN KEY (id_tienda) REFERENCES tiendas (id_tienda)
);

CREATE TABLE IF NOT EXISTS categorias (
    id_categoria INT AUTO_INCREMENT PRIMARY KEY,
    nombre_categoria VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS productos (
    id_producto INT AUTO_INCREMENT PRIMARY KEY,
    nombre_producto VARCHAR(100),
    precio DECIMAL(5, 2),
    stock INT,
    id_categoria INT NOT NULL,
    FOREIGN KEY (id_categoria) REFERENCES categorias (id_categoria)
);

CREATE TABLE IF NOT EXISTS clientes (
    id_cliente INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(255),
    codigo_postal INT(5)
);

CREATE TABLE IF NOT EXISTS ordenes (
    id_orden INT AUTO_INCREMENT PRIMARY KEY,
    id_cliente INT NOT NULL,
    id_empleado INT NOT NULL,
    fecha_orden DATETIME,
    metodo_pago ENUM('Tarjeta', 'Efectivo'),
    FOREIGN KEY (id_cliente) REFERENCES clientes (id_cliente),
    FOREIGN KEY (id_empleado) REFERENCES empleados (id_empleado)
);

CREATE TABLE IF NOT EXISTS detalle_orden (
    id_detalle INT AUTO_INCREMENT PRIMARY KEY,
    id_orden INT NOT NULL,
    id_producto INT NOT NULL,
    cantidad INT,
    precio_unitario DECIMAL(5, 2), -- mismo precio que en la tabla producto
    descuento DECIMAL(3, 2),
    FOREIGN KEY (id_orden) REFERENCES ordenes (id_orden),
    FOREIGN KEY (id_producto) REFERENCES productos (id_producto)
);
"""

Conexión a MySQL y ejecución de codigo de creacion

In [72]:
connection = con.connect(
    host="localhost",
    port= "3306",
    user= "root",
    password= "admin"
)

cursor = connection.cursor()
cursor.execute(sql_creacion)
cursor.close()
connection.close()

# PARTE 2: GENERAR DATOS DEMO DESDE PYTHON

In [73]:
import random

## TIENDAS

In [74]:
ciudades = ['Málaga', 'Madrid', 'San Sebastian']
brand = 'SUPER24H'
tipo_via = ['Plaza', 'Calle', 'Avenida']
nombres_calle = ['Costitución', 'Libertad', 'Conocimiento', 'Pacífico', 'América']
tienda = []
for ciudad in ciudades:
    for num in range(1,6):
        direccion = f"{random.choice(tipo_via)}, {random.choice(nombres_calle)}, {random.randint(1, 150)}"
        tienda.append([f'{brand}_{ciudad}_{num}', direccion, ciudad])

df_tienda = pd.DataFrame(tienda, columns=['nombre_tienda', 'direccion', 'ciudad'])
df_tienda=df_tienda.reset_index().rename({'index': 'id_tienda'}, axis=1)
df_tienda['id_tienda'] = df_tienda['id_tienda'] + 1
df_tienda

,id_tienda,nombre_tienda,direccion,ciudad
0,1,SUPER24H_Málaga_1,"Plaza, Libertad, 134",Málaga
1,2,SUPER24H_Málaga_2,"Avenida, América, 117",Málaga
2,3,SUPER24H_Málaga_3,"Calle, Conocimiento, 3",Málaga
3,4,SUPER24H_Málaga_4,"Avenida, América, 35",Málaga
4,5,SUPER24H_Málaga_5,"Calle, Pacífico, 100",Málaga
5,6,SUPER24H_Madrid_1,"Avenida, América, 2",Madrid
6,7,SUPER24H_Madrid_2,"Plaza, Pacífico, 76",Madrid
7,8,SUPER24H_Madrid_3,"Avenida, América, 143",Madrid
8,9,SUPER24H_Madrid_4,"Calle, Conocimiento, 67",Madrid
9,10,SUPER24H_Madrid_5,"Calle, Libertad, 147",Madrid
10,11,SUPER24H_San Sebastian_1,"Avenida, Pacífico, 93",San Sebastian
11,12,SUPER24H_San Sebastian_2,"Plaza, Libertad, 31",San Sebastian
12,13,SUPER24H_San Sebastian_3,"Plaza, Pacífico, 141",San Sebastian
13,14,SUPER24H_San Sebastian_4,"Avenida, Costitución, 108",San Sebastian
14,15,SUPER24H_San Sebastian_5,"Avenida, Libertad, 87",San Sebastian

## EMPLEADOS

In [75]:
def selec_puesto(num, puestos):
    if num < 5:
        return puestos[0]
    elif num < 10:
        return puestos[1]
    elif num < 15:
        return puestos[2]
    elif num < 19:
        return puestos[3]
    else:
        return puestos[4]

puestos = ['Cajero', 'Reponedor', 'Mozo de Almacen', 'Jefe de Seccion', 'Gerente']
nombres = ['Carolina', 'Cecilia', 'Alan', 'Kike', 'Panchi', 'Carlos', 'Carmen', 'Emilio', 'Jose Ignacio', 'Luis', 'Maria', 'Marino','Nerea','Noelia', 'Oscar', 'Pablo', 'Rafael']
apellidos = ['García', 'Martínez', 'López', 'Hernández', 'González', 'Pérez', 'Rodríguez', 'Sánchez', 'Ramírez', 'Torres', 'Flores', 'Rivera', 'Díaz', 'Cruz', 'Morales']
tiendas = df_tienda['id_tienda']
empleados = []

for tienda in tiendas:
    for num in range(20):
        nombre = f'{random.choice(nombres)} {random.choice(apellidos)} {random.choice(apellidos)}'
        puesto = selec_puesto(num, puestos)
        empleados.append([nombre, puesto, tienda])
        
df_empleados = pd.DataFrame(empleados, columns=['nombre_empleado', 'puesto', 'id_tienda'])
df_empleados=df_empleados.reset_index().rename({'index': 'id_empleado'}, axis=1)
df_empleados['id_empleado'] = df_empleados['id_empleado'] + 1
df_empleados

     id_empleado              nombre_empleado           puesto  id_tienda
0              1    Carmen Martínez Rodríguez           Cajero          1
1              2    Carolina Sánchez González           Cajero          1
2              3  Jose Ignacio Cruz Hernández           Cajero          1
3              4       Rafael Hernández Pérez           Cajero          1
4              5      Marino Hernández Flores           Cajero          1
..           ...                          ...              ...        ...
295          296  Jose Ignacio López González  Jefe de Seccion         15
296          297          Emilio Morales Díaz  Jefe de Seccion         15
297          298        Panchi Rodríguez Díaz  Jefe de Seccion         15
298          299      Marino Rodríguez García  Jefe de Seccion         15
299          300         Panchi Díaz González          Gerente         15

[300 rows x 4 columns]

## CATEGORIAS

In [76]:
categorias = [
    'Frutería',
    'Carnicería',
    'Pescadería',
    'Panadería y Pastelería',
    'Lácteos y Huevos',
    'Bebidas',
    'Droguería y Limpieza',
    'Conservas y Alimentos enlatados',
    'Congelados',
    'Alimentos Secos y Básicos'
]

df_categorias = pd.DataFrame(categorias, columns=['nombre_categoria'])
df_categorias=df_categorias.reset_index().rename({'index': 'id_categoria'}, axis=1)
df_categorias['id_categoria'] = df_categorias['id_categoria'] + 1
df_categorias

   id_categoria                 nombre_categoria
0             1                         Frutería
1             2                       Carnicería
2             3                       Pescadería
3             4           Panadería y Pastelería
4             5                 Lácteos y Huevos
5             6                          Bebidas
6             7             Droguería y Limpieza
7             8  Conservas y Alimentos enlatados
8             9                       Congelados
9            10        Alimentos Secos y Básicos

## PRODUCTOS

In [77]:
productos = {
    1: ['Manzanas', 'Plátanos', 'Naranjas', 'Lechugas'],  # Frutería
    2: ['Pollo', 'Ternera', 'Cerdo', 'Cordero'],           # Carnicería
    3: ['Merluza', 'Salmón', 'Atún', 'Calamares'],         # Pescadería
    4: ['Pan integral', 'Croissants', 'Donuts', 'Baguette'], # Panadería y Pastelería
    5: ['Leche', 'Queso', 'Yogur', 'Huevos'],              # Lácteos y Huevos
    6: ['Agua', 'Refrescos', 'Vino tinto', 'Cerveza'],     # Bebidas
    7: ['Detergente', 'Esponjas', 'Desinfectante', 'Papel higiénico'], # Droguería y Limpieza
    8: ['Atún enlatado', 'Sopa de tomate', 'Maíz dulce', 'Guisantes en conserva'], # Conservas y Alimentos enlatados
    9: ['Pizza congelada', 'Helado', 'Verduras congeladas', 'Nuggets de pollo'], # Congelados
    10: ['Arroz', 'Pasta', 'Lentejas', 'Harina']          # Alimentos Secos y Básicos
}

producto_completo = []

for categoria in df_categorias['id_categoria']:
    for producto in productos[categoria]:
        precio = round(random.uniform(0.50, 150.00), 2)
        stock = random.randint(0,500)
        producto_completo.append([producto, precio, stock, categoria])
        
df_productos = pd.DataFrame(producto_completo, columns=['nombre_producto','precio','stock', 'id_categoria'])
df_productos=df_productos.reset_index().rename({'index': 'id_producto'}, axis=1)
df_productos['id_producto'] = df_productos['id_producto'] + 1
df_productos

    id_producto        nombre_producto  precio  stock  id_categoria
0             1               Manzanas   18.20    455             1
1             2               Plátanos   96.40    164             1
2             3               Naranjas   55.00    431             1
3             4               Lechugas  104.72    149             1
4             5                  Pollo  144.99     46             2
5             6                Ternera   45.53    331             2
6             7                  Cerdo   39.87    330             2
7             8                Cordero    3.04    129             2
8             9                Merluza  108.68    343             3
9            10                 Salmón  108.33     51             3
10           11                   Atún  121.29     84             3
11           12              Calamares  146.59    295             3
12           13           Pan integral   90.97    401             4
13           14             Croissants   99.90    289             4
14           15                 Donuts   61.99    120             4
15           16               Baguette   87.70    407             4
16           17                  Leche   98.69    287             5
17           18                  Queso  128.88    334             5
18           19                  Yogur  134.60     26             5
19           20                 Huevos   98.61    280             5
20           21                   Agua  139.01    159             6
21           22              Refrescos  105.46    225             6
22           23             Vino tinto  118.05     64             6
23           24                Cerveza  136.47    417             6
24           25             Detergente  102.51    432             7
25           26               Esponjas   15.89    260             7
26           27          Desinfectante   23.18    155             7
27           28        Papel higiénico   46.19     57             7
28           29          Atún enlatado  131.98      1             8
29           30         Sopa de tomate  103.55     97             8
30           31             Maíz dulce  100.82    366             8
31           32  Guisantes en conserva   25.60    219             8
32           33        Pizza congelada   24.05    177             9
33           34                 Helado   90.69    370             9
34           35    Verduras congeladas   23.42    226             9
35           36       Nuggets de pollo   47.55    198             9
36           37                  Arroz   13.23    259            10
37           38                  Pasta  145.89     34            10
38           39               Lentejas    7.04    227            10
39           40                 Harina   34.90     81            10

## CLIENTES

In [78]:
nombres = ['Carolina', 'Cecilia', 'Alan', 'Kike', 'Panchi', 'Carlos', 'Carmen', 'Emilio', 'Jose Ignacio', 'Luis', 'Maria', 'Marino','Nerea','Noelia', 'Oscar', 'Pablo', 'Rafael']
apellidos = ['García', 'Martínez', 'López', 'Hernández', 'González', 'Pérez', 'Rodríguez', 'Sánchez', 'Ramírez', 'Torres', 'Flores', 'Rivera', 'Díaz', 'Cruz', 'Morales']
emails = ['gmail', 'yahoo', 'hotmail']
codigo_postal = [29000, 28000, 20000]

cliente = []

for num in range (2000):
    nombre = f'{random.choice(nombres)}'
    apellido = f'{random.choice(apellidos)} {random.choice(apellidos)}'
    email = f'{nombre.lower()}.{apellido.split()[0][:1].lower()}{apellido.split()[1][:1].lower()}@{random.choice(emails)}.com'
    cp = random.choice(codigo_postal) + random.randint(1, 25)
    cliente.append([nombre, apellido, email, cp])
    
df_clientes = pd.DataFrame(cliente, columns=['first_name','last_name','email','codigo_postal'])
df_clientes=df_clientes.reset_index().rename({'index': 'id_cliente'}, axis=1)
df_clientes['id_cliente'] = df_clientes['id_cliente'] + 1
df_clientes

,id_cliente,first_name,last_name,email,codigo_postal
0,1,Carmen,Hernández Flores,carmen.hf@yahoo.com,20005
1,2,Pablo,García García,pablo.gg@yahoo.com,28025
2,3,Cecilia,Díaz Morales,cecilia.dm@hotmail.com,29007
3,4,Marino,Ramírez Torres,marino.rt@yahoo.com,20021
4,5,Rafael,González García,rafael.gg@hotmail.com,29006
...,...,...,...,...,...
1995,1996,Pablo,Hernández Cruz,pablo.hc@hotmail.com,20006
1996,1997,Carlos,Pérez Rodríguez,carlos.pr@gmail.com,20009
1997,1998,Carmen,Pérez García,carmen.pg@yahoo.com,28007
1998,1999,Luis,Martínez Rodríguez,luis.mr@yahoo.com,29006
1999,2000,Pablo,Torres Hernández,pablo.th@gmail.com,20011

## ORDENES

In [79]:
import datetime
from datetime import datetime, timedelta

clientes = df_clientes['id_cliente']
empleados = df_empleados['id_empleado']
ordenes = []

fecha_inicial = datetime(year=2017, month=1, day=2, hour=9, minute=00)
for orden in range (10000):
    cliente = int(random.choice(clientes))
    empleado = int(random.choice(empleados))
    fecha = fecha_inicial + timedelta(minutes=30*orden)
    metodo = random.choice(['Tarjeta', 'Efectivo'])
    ordenes.append([cliente, empleado, fecha, metodo])
    
df_ordenes = pd.DataFrame(ordenes, columns=['id_cliente','id_empleado', 'fecha_orden', 'metodo_pago'])
df_ordenes=df_ordenes.reset_index().rename({'index': 'id_orden'}, axis=1)
df_ordenes['id_orden'] = df_ordenes['id_orden'] + 1
df_ordenes

      id_orden  id_cliente  id_empleado         fecha_orden metodo_pago
0            1         393          227 2017-01-02 09:00:00    Efectivo
1            2         817          208 2017-01-02 09:30:00     Tarjeta
2            3        1389          173 2017-01-02 10:00:00    Efectivo
3            4         127          177 2017-01-02 10:30:00     Tarjeta
4            5         684          269 2017-01-02 11:00:00    Efectivo
...        ...         ...          ...                 ...         ...
9995      9996          53          182 2017-07-29 14:30:00    Efectivo
9996      9997        1075          168 2017-07-29 15:00:00    Efectivo
9997      9998        1730          151 2017-07-29 15:30:00    Efectivo
9998      9999         684          102 2017-07-29 16:00:00    Efectivo
9999     10000        1921           43 2017-07-29 16:30:00     Tarjeta

[10000 rows x 5 columns]

## DETALLE ORDEN

In [80]:
productos = df_productos['id_producto']
ordenes = df_ordenes['id_orden']
detalles = []

for orden in ordenes:
    for num in range(1, 4):
        producto = int(random.choice(productos))
        cantidad = random.randint(1,20)
        descuento = float(round(random.uniform(0.00, 5.00), 2))
        precio = float(round(df_productos['precio'][df_productos['id_producto'] == producto].iloc[0]))
        detalles.append([orden, producto, cantidad, precio, descuento])
        
df_detalles_orden = pd.DataFrame(detalles, columns=['id_orden','id_producto', 'cantidad', 'precio_unitario', 'descuento'])
df_detalles_orden=df_detalles_orden.reset_index().rename({'index': 'id_detalle'}, axis=1)
df_detalles_orden['id_detalle'] = df_detalles_orden['id_detalle'] + 1
df_detalles_orden

       id_detalle  id_orden  id_producto  cantidad  precio_unitario  descuento
0               1         1           10        17            108.0       1.50
1               2         1           13         6             91.0       2.26
2               3         1           23         7            118.0       0.15
3               4         2           12        18            147.0       2.68
4               5         2           17         2             99.0       4.22
...           ...       ...          ...       ...              ...        ...
29995       29996      9999           29        15            132.0       4.77
29996       29997      9999            9         9            109.0       0.86
29997       29998     10000           13         7             91.0       0.72
29998       29999     10000           23         3            118.0       3.33
29999       30000     10000           29        20            132.0       1.79

[30000 rows x 6 columns]

## CARGA DE DATOS CON PANDAS

Crear la conexion

In [81]:
user = "root"
password = "admin"
database = "supermercado"

# Crear la conexión
engine = create_engine(f"mysql+pymysql://{user}:{password}@localhost/{database}")

# Abrir una conección
connection = engine.connect()

# Cerrar la conección
connection.close()

Carga de datos

In [82]:
df_tienda.to_sql(name = "tiendas", con = engine, if_exists = "append", index = False)
df_empleados.to_sql(name = "empleados", con = engine, if_exists = "append", index = False)
df_categorias.to_sql(name = "categorias", con = engine, if_exists = "append", index = False)
df_productos.to_sql(name = "productos", con = engine, if_exists = "append", index = False)
df_clientes.to_sql(name = "clientes", con = engine, if_exists = "append", index = False)
df_ordenes.to_sql(name = "ordenes", con = engine, if_exists = "append", index = False)
df_detalles_orden.to_sql(name = "detalle_orden", con = engine, if_exists = "append", index = False)

30000

# PARTE 3: CONSULTAS SQL

1. Listado de órdenes con detalles de cliente y empleado
* Muestra el ID de la orden, la fecha, el nombre del cliente, el nombre del empleado que atendió la compra y el método de pago.
* Utiliza un JOIN entre las tablas ordenes, clientes y empleados.

In [83]:
sql = """ 
SELECT 
	o.id_orden, 
    o.fecha_orden, 
    concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    e.nombre_empleado,
    o.metodo_pago
FROM
	ordenes o
JOIN
	clientes c on o.id_cliente = c.id_cliente
JOIN
	empleados e on o.id_empleado = e.id_empleado;
"""

df = pd.read_sql(sql, engine)

df

,id_orden,fecha_orden,nombre_cliente,nombre_empleado,metodo_pago
0,1719,2017-02-07 04:00:00,Marino Cruz Díaz,Carmen Martínez Rodríguez,Efectivo
1,1939,2017-02-11 18:00:00,Panchi Cruz Martínez,Carmen Martínez Rodríguez,Tarjeta
2,2916,2017-03-04 02:30:00,Carlos González Ramírez,Carmen Martínez Rodríguez,Efectivo
3,3044,2017-03-06 18:30:00,Maria López Díaz,Carmen Martínez Rodríguez,Efectivo
4,3156,2017-03-09 02:30:00,Maria Torres Rodríguez,Carmen Martínez Rodríguez,Efectivo
...,...,...,...,...,...
9995,9215,2017-07-13 08:00:00,Rafael Hernández Ramírez,Panchi Díaz González,Efectivo
9996,9474,2017-07-18 17:30:00,Luis López Flores,Panchi Díaz González,Efectivo
9997,9567,2017-07-20 16:00:00,Cecilia Flores Rodríguez,Panchi Díaz González,Efectivo
9998,9712,2017-07-23 16:30:00,Oscar García Rivera,Panchi Díaz González,Efectivo
9999,9796,2017-07-25 10:30:00,Jose Ignacio Rodríguez Morales,Panchi Díaz González,Tarjeta


2. Productos con stock bajo
* Filtra aquellos productos cuyo stock sea menor a 10.
* Muestra nombre del producto, categoría y stock.

In [84]:
sql = """ 
SELECT 
	p.nombre_producto, 
    c.nombre_categoria, 
    p.stock
FROM 
	productos p
JOIN
	categorias c on p.id_categoria = c.id_categoria
WHERE p.stock < 10;
"""

df = pd.read_sql(sql, engine)

df

  nombre_producto                 nombre_categoria  stock
0   Atún enlatado  Conservas y Alimentos enlatados      1

3. Ventas totales por categoría
* Muestra el nombre de la categoría y la suma total de las ventas (ej.: multiplicando cantidad * precio_unitario) para cada categoría.
* Realiza el JOIN con detalle_orden, productos y categorias.
* Utiliza agrupación (GROUP BY).

In [85]:
sql = """ 
SELECT
	c.nombre_categoria, sum(d.precio_unitario*d.cantidad) as Venta_Total
FROM
	productos p
JOIN
	categorias c on p.id_categoria = c.id_categoria
JOIN
	detalle_orden d on p.id_producto = d.id_producto
GROUP BY c.nombre_categoria
"""

df = pd.read_sql(sql, engine)

df

                  nombre_categoria  Venta_Total
0                         Frutería    2081378.0
1                       Carnicería    1860736.0
2                       Pescadería    3805882.0
3           Panadería y Pastelería    2782813.0
4                 Lácteos y Huevos    3683847.0
5                          Bebidas    3884047.0
6             Droguería y Limpieza    1497275.0
7  Conservas y Alimentos enlatados    2869771.0
8                       Congelados    1452685.0
9        Alimentos Secos y Básicos    1597095.0

4. Clientes con mayores gastos acumulados
* Muestra el nombre del cliente y el monto total que ha gastado (suma de todas sus órdenes).
* Asegúrate de tener en cuenta posibles descuentos (descuento) si se ha definido. Por ejemplo, la fórmula podría ser (cantidad * precio_unitario) - descuento.
* Ordena el resultado de mayor a menor gasto acumulado.

In [86]:
sql = """ 
SELECT 
	concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    sum((d.precio_unitario*d.cantidad)-d.descuento) as Gasto_Total_Con_Descuento,
    sum(d.precio_unitario*d.cantidad) as Gasto_Total_Sin_Descuento
FROM 
	ordenes o
JOIN
	clientes c on o.id_cliente = c.id_cliente
JOIN
	detalle_orden d on o.id_orden = d.id_orden
GROUP BY nombre_cliente
ORDER BY Gasto_Total_Con_Descuento DESC;
"""

df = pd.read_sql(sql, engine)

df

,nombre_cliente,Gasto_Total_Con_Descuento,Gasto_Total_Sin_Descuento
0,Panchi Martínez Martínez,61255.25,61416.0
1,Alan López Cruz,60305.80,60466.0
2,Alan Sánchez Rivera,60176.57,60335.0
3,Pablo Torres Martínez,59820.14,59959.0
4,Oscar Hernández Pérez,59162.01,59293.0
...,...,...,...
1576,Maria Flores Martínez,1115.56,1125.0
1577,Luis Rodríguez Rivera,1050.38,1058.0
1578,Nerea Flores Martínez,946.05,951.0
1579,Kike Martínez Pérez,879.44,886.0
1580,Emilio Ramírez García,835.74,840.0

5. Empleados y número de órdenes gestionadas
* Muestra el nombre del empleado, el puesto y la cantidad de órdenes que ha gestionado.
* Utiliza GROUP BY y COUNT.

In [87]:
sql = """ 
SELECT
	e.nombre_empleado, 
    e.puesto, 
    count(o.id_empleado) as gestionadas
FROM 
	empleados e
JOIN
	ordenes o on e.id_empleado=o.id_empleado
GROUP BY e.nombre_empleado, e.puesto
"""

df = pd.read_sql(sql, engine)

df

                 nombre_empleado           puesto  gestionadas
0      Carmen Martínez Rodríguez           Cajero           26
1      Carolina Sánchez González           Cajero           37
2    Jose Ignacio Cruz Hernández           Cajero           38
3         Rafael Hernández Pérez           Cajero           39
4        Marino Hernández Flores           Cajero           51
..                           ...              ...          ...
293  Jose Ignacio López González  Jefe de Seccion           32
294          Emilio Morales Díaz  Jefe de Seccion           35
295        Panchi Rodríguez Díaz  Jefe de Seccion           35
296      Marino Rodríguez García  Jefe de Seccion           38
297         Panchi Díaz González          Gerente           37

[298 rows x 3 columns]

6. Ordenes filtradas por fecha y tienda
* Muestra todas las órdenes que se realizaron en un rango de fechas determinado (ej.: del 1 de enero de 2025 al 31 de enero de 2025) y en una tienda específica.
* Incluye datos de la tienda y del cliente.

In [88]:
sql = """ 
SELECT 
	t.nombre_tienda, 
	concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    o.*
FROM 
	ordenes o
JOIN 
	clientes c on o.id_cliente = c.id_cliente
JOIN
	empleados e on o.id_empleado = e.id_empleado
JOIN
	tiendas t on e.id_tienda = t.id_tienda
WHERE o.fecha_orden > "2017-01-31 23:59:00" AND o.fecha_orden < "2017-03-01";
"""

df = pd.read_sql(sql, engine)

df

,nombre_tienda,nombre_cliente,id_orden,id_cliente,id_empleado,fecha_orden,metodo_pago
0,SUPER24H_Málaga_1,Marino Cruz Díaz,1719,812,1,2017-02-07 04:00:00,Efectivo
1,SUPER24H_Málaga_1,Panchi Cruz Martínez,1939,1871,1,2017-02-11 18:00:00,Tarjeta
2,SUPER24H_Málaga_1,Rafael Rivera Morales,1580,359,2,2017-02-04 06:30:00,Efectivo
3,SUPER24H_Málaga_1,Jose Ignacio Pérez Martínez,1715,1649,2,2017-02-07 02:00:00,Tarjeta
4,SUPER24H_Málaga_1,Carlos López Sánchez,1959,1501,2,2017-02-12 04:00:00,Tarjeta
...,...,...,...,...,...,...,...
1339,SUPER24H_San Sebastian_5,Jose Ignacio Torres López,1760,1486,300,2017-02-08 00:30:00,Tarjeta
1340,SUPER24H_San Sebastian_5,Carmen Díaz Martínez,1963,49,300,2017-02-12 06:00:00,Efectivo
1341,SUPER24H_San Sebastian_5,Luis Cruz Díaz,2511,415,300,2017-02-23 16:00:00,Tarjeta
1342,SUPER24H_San Sebastian_5,Kike Hernández González,2513,1283,300,2017-02-23 17:00:00,Efectivo
1343,SUPER24H_San Sebastian_5,Emilio Sánchez Díaz,2643,1036,300,2017-02-26 10:00:00,Tarjeta

7. Ranking de productos más vendidos en cada tienda
* Para cada tienda, muestra los 3 productos más vendidos (en términos de cantidad total).
* Tendrás que unir tiendas, empleados, ordenes y detalle_orden, además de productos.
* Usa GROUP BY y ordena por la cantidad sumada (y opcionalmente, un LIMIT 3).

In [ ]:
sql = """ 
SELECT
    t1.nombre_tienda,
    t1.nombre_producto,
    t1.cantidad_total
FROM (
    SELECT
        t.nombre_tienda,
        p.nombre_producto,
        SUM(d.cantidad) AS cantidad_total
    FROM
        tiendas t
    JOIN 
        empleados e ON t.id_tienda = e.id_tienda
    JOIN
        ordenes o ON e.id_empleado = o.id_empleado
    JOIN
        detalle_orden d ON o.id_orden = d.id_orden
    JOIN
        productos p ON d.id_producto = p.id_producto
    GROUP BY 
        t.nombre_tienda, p.nombre_producto
) t1
WHERE 
    (
        SELECT COUNT(*)
        FROM (
            SELECT
                t.nombre_tienda,
                p.nombre_producto,
                SUM(d.cantidad) AS cantidad_total
            FROM
                tiendas t
            JOIN 
                empleados e ON t.id_tienda = e.id_tienda
            JOIN
                ordenes o ON e.id_empleado = o.id_empleado
            JOIN
                detalle_orden d ON o.id_orden = d.id_orden
            JOIN
                productos p ON d.id_producto = p.id_producto
            GROUP BY 
                t.nombre_tienda, p.nombre_producto
        ) sub
        WHERE sub.nombre_tienda = t1.nombre_tienda         -- Contamos para cada tienda y producto, cuantos tipos de productos se han vendido mas que 
        AND sub.cantidad_total > t1.cantidad_total         -- el producto que estamos analizando. Vamos a seleccionar los que tengan 0, 1, 2
    ) < 3 
ORDER BY 
    t1.nombre_tienda, t1.cantidad_total DESC;
"""

df = pd.read_sql(sql, engine)

df

               nombre_tienda      nombre_producto  cantidad_total
0          SUPER24H_Madrid_1             Esponjas           672.0
1          SUPER24H_Madrid_1                Pasta           661.0
2          SUPER24H_Madrid_1                Arroz           646.0
3          SUPER24H_Madrid_2               Huevos           664.0
4          SUPER24H_Madrid_2           Maíz dulce           643.0
5          SUPER24H_Madrid_2         Pan integral           639.0
6          SUPER24H_Madrid_3             Lechugas           715.0
7          SUPER24H_Madrid_3           Detergente           701.0
8          SUPER24H_Madrid_3         Pan integral           645.0
9          SUPER24H_Madrid_4                Cerdo           702.0
10         SUPER24H_Madrid_4                Leche           672.0
11         SUPER24H_Madrid_4                Yogur           670.0
12         SUPER24H_Madrid_5                Queso           747.0
13         SUPER24H_Madrid_5                Cerdo           740.0
14         SUPER24H_Madrid_5         Pan integral           729.0
15         SUPER24H_Málaga_1      Pizza congelada           721.0
16         SUPER24H_Málaga_1                Queso           712.0
17         SUPER24H_Málaga_1       Sopa de tomate           686.0
18         SUPER24H_Málaga_2      Papel higiénico           656.0
19         SUPER24H_Málaga_2                 Atún           648.0
20         SUPER24H_Málaga_2                Arroz           638.0
21         SUPER24H_Málaga_3        Desinfectante           726.0
22         SUPER24H_Málaga_3           Detergente           692.0
23         SUPER24H_Málaga_3              Ternera           659.0
24         SUPER24H_Málaga_4              Ternera           711.0
25         SUPER24H_Málaga_4     Nuggets de pollo           653.0
26         SUPER24H_Málaga_4                Cerdo           645.0
27         SUPER24H_Málaga_5             Lentejas           693.0
28         SUPER24H_Málaga_5               Huevos           655.0
29         SUPER24H_Málaga_5               Donuts           647.0
30  SUPER24H_San Sebastian_1             Lentejas           803.0
31  SUPER24H_San Sebastian_1             Baguette           776.0
32  SUPER24H_San Sebastian_1        Desinfectante           763.0
33  SUPER24H_San Sebastian_2           Vino tinto           700.0
34  SUPER24H_San Sebastian_2               Huevos           697.0
35  SUPER24H_San Sebastian_2               Harina           677.0
36  SUPER24H_San Sebastian_3      Pizza congelada           698.0
37  SUPER24H_San Sebastian_3                Arroz           667.0
38  SUPER24H_San Sebastian_3                Queso           654.0
39  SUPER24H_San Sebastian_4           Croissants           617.0
40  SUPER24H_San Sebastian_4               Harina           609.0
41  SUPER24H_San Sebastian_4              Merluza           592.0
42  SUPER24H_San Sebastian_5  Verduras congeladas           729.0
43  SUPER24H_San Sebastian_5              Cerveza           698.0
44  SUPER24H_San Sebastian_5                Pasta           696.0